{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "9d0fae44",
   "metadata": {},
   "source": [
    "# AGVCH Checker"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "40ad3dcc",
   "metadata": {},
   "source": [
    "## Get Official Data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "ac858fcd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "HistoricalCode      int64\n",
      "BfsCode             Int64\n",
      "ValidFrom          object\n",
      "ValidTo           float64\n",
      "Level               int64\n",
      "Parent              Int64\n",
      "Name               object\n",
      "ShortName          object\n",
      "Inscription         Int64\n",
      "Radiation         float64\n",
      "Rec_Type_fr        object\n",
      "Rec_Type_de        object\n",
      "dtype: object\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>HistoricalCode</th>\n",
       "      <th>BfsCode</th>\n",
       "      <th>ValidFrom</th>\n",
       "      <th>ValidTo</th>\n",
       "      <th>Level</th>\n",
       "      <th>Parent</th>\n",
       "      <th>Name</th>\n",
       "      <th>ShortName</th>\n",
       "      <th>Inscription</th>\n",
       "      <th>Radiation</th>\n",
       "      <th>Rec_Type_fr</th>\n",
       "      <th>Rec_Type_de</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>12.09.1848</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "      <td>Zürich</td>\n",
       "      <td>ZH</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>10053</td>\n",
       "      <td>101</td>\n",
       "      <td>12.09.1848</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2</td>\n",
       "      <td>1</td>\n",
       "      <td>Bezirk Affoltern</td>\n",
       "      <td>Affoltern</td>\n",
       "      <td>100</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>10575</td>\n",
       "      <td>13</td>\n",
       "      <td>12.09.1848</td>\n",
       "      <td>NaN</td>\n",
       "      <td>3</td>\n",
       "      <td>10053</td>\n",
       "      <td>Stallikon</td>\n",
       "      <td>Stallikon</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>11742</td>\n",
       "      <td>2</td>\n",
       "      <td>12.09.1848</td>\n",
       "      <td>NaN</td>\n",
       "      <td>3</td>\n",
       "      <td>10053</td>\n",
       "      <td>Affoltern am Albis</td>\n",
       "      <td>Affoltern am Albis</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>11801</td>\n",
       "      <td>3</td>\n",
       "      <td>12.09.1848</td>\n",
       "      <td>NaN</td>\n",
       "      <td>3</td>\n",
       "      <td>10053</td>\n",
       "      <td>Bonstetten</td>\n",
       "      <td>Bonstetten</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   HistoricalCode  BfsCode   ValidFrom  ValidTo  Level  Parent  \\\n",
       "0               1        1  12.09.1848      NaN      1    <NA>   \n",
       "1           10053      101  12.09.1848      NaN      2       1   \n",
       "2           10575       13  12.09.1848      NaN      3   10053   \n",
       "3           11742        2  12.09.1848      NaN      3   10053   \n",
       "4           11801        3  12.09.1848      NaN      3   10053   \n",
       "\n",
       "                 Name           ShortName  Inscription  Radiation Rec_Type_fr  \\\n",
       "0              Zürich                  ZH         <NA>        NaN         NaN   \n",
       "1    Bezirk Affoltern           Affoltern          100        NaN         NaN   \n",
       "2           Stallikon           Stallikon         <NA>        NaN         NaN   \n",
       "3  Affoltern am Albis  Affoltern am Albis         <NA>        NaN         NaN   \n",
       "4          Bonstetten          Bonstetten         <NA>        NaN         NaN   \n",
       "\n",
       "  Rec_Type_de  \n",
       "0         NaN  \n",
       "1         NaN  \n",
       "2         NaN  \n",
       "3         NaN  \n",
       "4         NaN  "
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "from datetime import datetime\n",
    "\n",
    "official_raw = pd.read_csv(f\"https://www.agvchapp.bfs.admin.ch/api/communes/snapshot?date={datetime.now().strftime('%d-%m-%Y')}\")\n",
    "\n",
    "# set datatypes\n",
    "official_raw.Parent = official_raw.Parent.astype(\"Int64\")\n",
    "official_raw.Inscription = official_raw.Inscription.astype(\"Int64\")\n",
    "official_raw.BfsCode = official_raw.BfsCode.astype(\"Int64\")\n",
    "\n",
    "print(official_raw.dtypes)\n",
    "official_raw.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "62e1abee",
   "metadata": {},
   "source": [
    "## Wrangle Official Data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "bba5c306",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "BfsCode     Int64\n",
      "Name       object\n",
      "dtype: object\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>BfsCode</th>\n",
       "      <th>Name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>13</td>\n",
       "      <td>Stallikon</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2</td>\n",
       "      <td>Affoltern am Albis</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>3</td>\n",
       "      <td>Bonstetten</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>4</td>\n",
       "      <td>Hausen am Albis</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>5</td>\n",
       "      <td>Hedingen</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   BfsCode                Name\n",
       "2       13           Stallikon\n",
       "3        2  Affoltern am Albis\n",
       "4        3          Bonstetten\n",
       "5        4     Hausen am Albis\n",
       "6        5            Hedingen"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "official = official_raw[official_raw[\"Level\"] == 3]\n",
    "official = official[[\"BfsCode\", \"Name\"]]\n",
    "print(official.dtypes)\n",
    "official.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bf6e0020",
   "metadata": {},
   "source": [
    "## Wikidata Data"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b2c5416e",
   "metadata": {},
   "source": [
    "### Define Query Function"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "30d17e08",
   "metadata": {},
   "outputs": [],
   "source": [
    "import requests\n",
    "import time\n",
    "\n",
    "def query_wikidata(query: str, max_retries: int = 5) -> pd.DataFrame:\n",
    "    \n",
    "    headers = {\n",
    "    \"User-Agent\": \"agvch-checker (https://github.com/bequrios/agvch-checker; mailto:bhitz@gmx.net)\"}\n",
    "\n",
    "    url = \"https://query.wikidata.org/sparql\"\n",
    "    \n",
    "    for attempt in range(max_retries):\n",
    "    \n",
    "        response = requests.get(url, params={\"query\": query, \"format\": \"json\"}, headers=headers)\n",
    "\n",
    "        if response.status_code == 200:\n",
    "            data = response.json()\n",
    "            return pd.json_normalize(data[\"results\"][\"bindings\"])\n",
    "        \n",
    "        elif response.status_code == 429:\n",
    "            # too many requests — check Retry-After header\n",
    "            retry_after = int(response.headers.get(\"Retry-After\", \"5\"))\n",
    "            print(f\"Rate limited. Waiting {retry_after} seconds before retrying...\")\n",
    "            time.sleep(retry_after)\n",
    "        \n",
    "        else:\n",
    "            # some other error, stop\n",
    "            response.raise_for_status()\n",
    "    \n",
    "    raise Exception(\"Max retries exceeded\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "848efcd6",
   "metadata": {},
   "source": [
    "### Get Wikidata Data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "95ef97ad",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "muni.type        object\n",
      "muni.value       object\n",
      "name.xml:lang    object\n",
      "name.type        object\n",
      "name.value       object\n",
      "bfs.type         object\n",
      "bfs.value        object\n",
      "dtype: object\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>muni.type</th>\n",
       "      <th>muni.value</th>\n",
       "      <th>name.xml:lang</th>\n",
       "      <th>name.type</th>\n",
       "      <th>name.value</th>\n",
       "      <th>bfs.type</th>\n",
       "      <th>bfs.value</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>uri</td>\n",
       "      <td>http://www.wikidata.org/entity/Q66604</td>\n",
       "      <td>de-ch</td>\n",
       "      <td>literal</td>\n",
       "      <td>Risch</td>\n",
       "      <td>literal</td>\n",
       "      <td>1707</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>uri</td>\n",
       "      <td>http://www.wikidata.org/entity/Q66611</td>\n",
       "      <td>und</td>\n",
       "      <td>literal</td>\n",
       "      <td>Oberhofen am Thunersee</td>\n",
       "      <td>literal</td>\n",
       "      <td>934</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>uri</td>\n",
       "      <td>http://www.wikidata.org/entity/Q66613</td>\n",
       "      <td>und</td>\n",
       "      <td>literal</td>\n",
       "      <td>Gurzelen</td>\n",
       "      <td>literal</td>\n",
       "      <td>867</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>uri</td>\n",
       "      <td>http://www.wikidata.org/entity/Q66617</td>\n",
       "      <td>de-ch</td>\n",
       "      <td>literal</td>\n",
       "      <td>Frick</td>\n",
       "      <td>literal</td>\n",
       "      <td>4163</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>uri</td>\n",
       "      <td>http://www.wikidata.org/entity/Q66623</td>\n",
       "      <td>de-ch</td>\n",
       "      <td>literal</td>\n",
       "      <td>Hemmiken</td>\n",
       "      <td>literal</td>\n",
       "      <td>2848</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  muni.type                             muni.value name.xml:lang name.type  \\\n",
       "0       uri  http://www.wikidata.org/entity/Q66604         de-ch   literal   \n",
       "1       uri  http://www.wikidata.org/entity/Q66611           und   literal   \n",
       "2       uri  http://www.wikidata.org/entity/Q66613           und   literal   \n",
       "3       uri  http://www.wikidata.org/entity/Q66617         de-ch   literal   \n",
       "4       uri  http://www.wikidata.org/entity/Q66623         de-ch   literal   \n",
       "\n",
       "               name.value bfs.type bfs.value  \n",
       "0                   Risch  literal      1707  \n",
       "1  Oberhofen am Thunersee  literal       934  \n",
       "2                Gurzelen  literal       867  \n",
       "3                   Frick  literal      4163  \n",
       "4                Hemmiken  literal      2848  "
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "SELECT * WHERE {\n",
    "  ?muni wdt:P31 wd:Q70208.\n",
    "  OPTIONAL { ?muni wdt:P1448 ?name . }\n",
    "  OPTIONAL { ?muni wdt:P771 ?bfs . }\n",
    "  MINUS{ ?muni wdt:P31 wd:Q685309. }\n",
    "}\n",
    "\"\"\"\n",
    "wiki_raw = query_wikidata(query)\n",
    "\n",
    "print(wiki_raw.dtypes)\n",
    "wiki_raw.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b871298e",
   "metadata": {},
   "source": [
    "### Wrangle Wikidata"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "58634e88",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "q         object\n",
      "name      object\n",
      "lang      object\n",
      "bfs       object\n",
      "bfsInt     Int64\n",
      "dtype: object\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>q</th>\n",
       "      <th>name</th>\n",
       "      <th>lang</th>\n",
       "      <th>bfs</th>\n",
       "      <th>bfsInt</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Q66604</td>\n",
       "      <td>Risch</td>\n",
       "      <td>de-ch</td>\n",
       "      <td>1707</td>\n",
       "      <td>1707</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Q66611</td>\n",
       "      <td>Oberhofen am Thunersee</td>\n",
       "      <td>und</td>\n",
       "      <td>934</td>\n",
       "      <td>934</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Q66613</td>\n",
       "      <td>Gurzelen</td>\n",
       "      <td>und</td>\n",
       "      <td>867</td>\n",
       "      <td>867</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Q66617</td>\n",
       "      <td>Frick</td>\n",
       "      <td>de-ch</td>\n",
       "      <td>4163</td>\n",
       "      <td>4163</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Q66623</td>\n",
       "      <td>Hemmiken</td>\n",
       "      <td>de-ch</td>\n",
       "      <td>2848</td>\n",
       "      <td>2848</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        q                    name   lang   bfs  bfsInt\n",
       "0  Q66604                   Risch  de-ch  1707    1707\n",
       "1  Q66611  Oberhofen am Thunersee    und   934     934\n",
       "2  Q66613                Gurzelen    und   867     867\n",
       "3  Q66617                   Frick  de-ch  4163    4163\n",
       "4  Q66623                Hemmiken  de-ch  2848    2848"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "wiki = wiki_raw[[\"muni.value\", \"name.value\", \"name.xml:lang\", \"bfs.value\"]].rename(columns={\n",
    "    \"muni.value\": \"q\",\n",
    "    \"name.value\": \"name\",\n",
    "    \"name.xml:lang\": \"lang\",\n",
    "    \"bfs.value\": \"bfs\"})\n",
    "\n",
    "wiki[\"q\"] = wiki[\"q\"].str.split(\"/\").str[-1]\n",
    "wiki[\"bfsInt\"] = wiki[\"bfs\"].astype(\"Int64\")\n",
    "print(wiki.dtypes)\n",
    "wiki.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ec42a251",
   "metadata": {},
   "source": [
    "## Merge Dataframes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "170e16ed",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "BfsCode       Int64\n",
      "Name         object\n",
      "q            object\n",
      "name         object\n",
      "lang         object\n",
      "bfs          object\n",
      "bfsInt        Int64\n",
      "_merge     category\n",
      "_nameOk    category\n",
      "_bfsOk     category\n",
      "dtype: object\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>BfsCode</th>\n",
       "      <th>Name</th>\n",
       "      <th>q</th>\n",
       "      <th>name</th>\n",
       "      <th>lang</th>\n",
       "      <th>bfs</th>\n",
       "      <th>bfsInt</th>\n",
       "      <th>_merge</th>\n",
       "      <th>_nameOk</th>\n",
       "      <th>_bfsOk</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>Aeugst am Albis</td>\n",
       "      <td>Q64945</td>\n",
       "      <td>Aeugst am Albis</td>\n",
       "      <td>de-ch</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>both</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>Affoltern am Albis</td>\n",
       "      <td>Q68290</td>\n",
       "      <td>Affoltern am Albis</td>\n",
       "      <td>de-ch</td>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>both</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>Bonstetten</td>\n",
       "      <td>Q65510</td>\n",
       "      <td>Bonstetten</td>\n",
       "      <td>de-ch</td>\n",
       "      <td>3</td>\n",
       "      <td>3</td>\n",
       "      <td>both</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "      <td>Hausen am Albis</td>\n",
       "      <td>Q65231</td>\n",
       "      <td>Hausen am Albis</td>\n",
       "      <td>de-ch</td>\n",
       "      <td>4</td>\n",
       "      <td>4</td>\n",
       "      <td>both</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "      <td>Hedingen</td>\n",
       "      <td>Q65129</td>\n",
       "      <td>Hedingen</td>\n",
       "      <td>de-ch</td>\n",
       "      <td>5</td>\n",
       "      <td>5</td>\n",
       "      <td>both</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   BfsCode                Name       q                name   lang bfs  bfsInt  \\\n",
       "0        1     Aeugst am Albis  Q64945     Aeugst am Albis  de-ch   1       1   \n",
       "1        2  Affoltern am Albis  Q68290  Affoltern am Albis  de-ch   2       2   \n",
       "2        3          Bonstetten  Q65510          Bonstetten  de-ch   3       3   \n",
       "3        4     Hausen am Albis  Q65231     Hausen am Albis  de-ch   4       4   \n",
       "4        5            Hedingen  Q65129            Hedingen  de-ch   5       5   \n",
       "\n",
       "  _merge _nameOk _bfsOk  \n",
       "0   both    True   True  \n",
       "1   both    True   True  \n",
       "2   both    True   True  \n",
       "3   both    True   True  \n",
       "4   both    True   True  "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "merge = pd.merge(official, wiki, left_on=\"BfsCode\", right_on=\"bfsInt\", how=\"outer\", indicator=True)\n",
    "merge[\"_merge\"] = merge[\"_merge\"].map({\n",
    "    \"left_only\": \"official_only\",\n",
    "    \"right_only\": \"wiki_only\",\n",
    "    \"both\": \"both\"\n",
    "})\n",
    "\n",
    "# new merge columns\n",
    "merge[\"_nameOk\"] = merge[\"Name\"] == merge[\"name\"]\n",
    "merge[\"_bfsOk\"] = merge[\"bfs\"] == merge[\"bfsInt\"].astype(str)\n",
    "\n",
    "# make categorical columns so that the summarizing is consistent (even if there are no False values, count them as zero)\n",
    "merge[\"_nameOk\"] = pd.Categorical(merge[\"_nameOk\"], categories=[True, False])\n",
    "merge[\"_bfsOk\"] = pd.Categorical(merge[\"_bfsOk\"], categories=[True, False])\n",
    "\n",
    "print(merge.dtypes)\n",
    "merge.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bbfed93f",
   "metadata": {},
   "source": [
    "## Summarise Merge"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "b6c000fa",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'_merge': {'both': 2119, 'wiki_only': 22, 'official_only': 1}, '_nameOk': {True: 1991, False: 151}, '_bfsOk': {True: 2138, False: 4}, '_bfsIntUnique': False, '_BfsCodeUnique': False, '_bfsIntNonUniqueValues': [None, 782, 1331, 2196, 2275, 3291, 6266, 6289, 6630, 6634, 6644], '_BfsCodeNonUniqueValues': [782, 1331, None, 2196, 2275, 3291, 6266, 6289, 6630, 6634, 6644]}\n"
     ]
    }
   ],
   "source": [
    "# Columns to summarize\n",
    "columns_to_summarize = [\"_merge\", \"_nameOk\", \"_bfsOk\"]\n",
    "\n",
    "summary = {col: merge[col].value_counts().to_dict() for col in columns_to_summarize}\n",
    "\n",
    "summary[\"_bfsIntUnique\"] = merge[\"bfsInt\"].is_unique\n",
    "summary[\"_BfsCodeUnique\"] = merge[\"BfsCode\"].is_unique\n",
    "\n",
    "summary\n",
    "summary[\"_bfsIntNonUniqueValues\"] = merge[\"BfsCode\"][merge[\"BfsCode\"].duplicated(keep=False)].unique().tolist()\n",
    "summary[\"_bfsIntNonUniqueValues\"] = [x if x is not pd.NA else None for x in summary[\"_bfsIntNonUniqueValues\"]]\n",
    "summary[\"_BfsCodeNonUniqueValues\"] = merge[\"bfsInt\"][merge[\"bfsInt\"].duplicated(keep=False)].unique().tolist()\n",
    "summary[\"_BfsCodeNonUniqueValues\"] = [x if x is not pd.NA else None for x in summary[\"_BfsCodeNonUniqueValues\"]]\n",
    "print(summary)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2a9c4e40",
   "metadata": {},
   "source": [
    "## Missing LINDAS Versions"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8ef191d4",
   "metadata": {},
   "source": [
    "### Fetch LINDAS Data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "6da86d92",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "identifier.datatype    object\n",
      "identifier.type        object\n",
      "identifier.value        Int64\n",
      "dtype: object\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>identifier.datatype</th>\n",
       "      <th>identifier.type</th>\n",
       "      <th>identifier.value</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.w3.org/2001/XMLSchema#integer</td>\n",
       "      <td>literal</td>\n",
       "      <td>13688</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://www.w3.org/2001/XMLSchema#integer</td>\n",
       "      <td>literal</td>\n",
       "      <td>10242</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://www.w3.org/2001/XMLSchema#integer</td>\n",
       "      <td>literal</td>\n",
       "      <td>10323</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.w3.org/2001/XMLSchema#integer</td>\n",
       "      <td>literal</td>\n",
       "      <td>14411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://www.w3.org/2001/XMLSchema#integer</td>\n",
       "      <td>literal</td>\n",
       "      <td>10459</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                        identifier.datatype identifier.type  identifier.value\n",
       "0  http://www.w3.org/2001/XMLSchema#integer         literal             13688\n",
       "1  http://www.w3.org/2001/XMLSchema#integer         literal             10242\n",
       "2  http://www.w3.org/2001/XMLSchema#integer         literal             10323\n",
       "3  http://www.w3.org/2001/XMLSchema#integer         literal             14411\n",
       "4  http://www.w3.org/2001/XMLSchema#integer         literal             10459"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Endpoint URL\n",
    "url = \"https://lindas.cz-aws.net/query\"\n",
    "\n",
    "headers = {\n",
    "    \"Accept\": \"application/sparql-results+json\"\n",
    "}\n",
    "\n",
    "# Query string to get BFS codes from Wikidata\n",
    "query = \"\"\"\n",
    "PREFIX schema: <http://schema.org/>\n",
    "PREFIX vl: <https://version.link/>\n",
    "SELECT ?identifier WHERE {\n",
    "?version a vl:Version;\n",
    "        vl:inVersionedIdentitySet <https://ld.admin.ch/fso/register>;\n",
    "        schema:identifier ?identifier.\n",
    "}\n",
    "\"\"\"\n",
    "# Make the request to the Wikidata SPARQL endpoint\n",
    "response = requests.get(url, params={'query': query}, headers=headers)\n",
    "lindas_raw = response.json()\n",
    "lindas_raw = pd.json_normalize(lindas_raw['results']['bindings'])\n",
    "\n",
    "# Convert BFS codes to int\n",
    "lindas_raw[\"identifier.value\"] = lindas_raw[\"identifier.value\"].astype(\"Int64\")\n",
    "\n",
    "print(lindas_raw.dtypes)\n",
    "lindas_raw.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "34c24c80",
   "metadata": {},
   "source": [
    "### Search Missing"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "2fe5faa5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "HistoricalCode     int64\n",
      "BfsCode            Int64\n",
      "ValidFrom         object\n",
      "Name              object\n",
      "dtype: object\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>HistoricalCode</th>\n",
       "      <th>BfsCode</th>\n",
       "      <th>ValidFrom</th>\n",
       "      <th>Name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>743</th>\n",
       "      <td>16671</td>\n",
       "      <td>2262</td>\n",
       "      <td>01.01.2026</td>\n",
       "      <td>Gurmels</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>828</th>\n",
       "      <td>16670</td>\n",
       "      <td>2056</td>\n",
       "      <td>01.01.2026</td>\n",
       "      <td>Fétigny-Ménières</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>943</th>\n",
       "      <td>16672</td>\n",
       "      <td>2525</td>\n",
       "      <td>01.01.2026</td>\n",
       "      <td>Kriegstetten</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1446</th>\n",
       "      <td>16673</td>\n",
       "      <td>4095</td>\n",
       "      <td>01.01.2026</td>\n",
       "      <td>Brugg</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2279</th>\n",
       "      <td>16669</td>\n",
       "      <td>6831</td>\n",
       "      <td>01.01.2026</td>\n",
       "      <td>Moutier</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      HistoricalCode  BfsCode   ValidFrom              Name\n",
       "743            16671     2262  01.01.2026           Gurmels\n",
       "828            16670     2056  01.01.2026  Fétigny-Ménières\n",
       "943            16672     2525  01.01.2026      Kriegstetten\n",
       "1446           16673     4095  01.01.2026             Brugg\n",
       "2279           16669     6831  01.01.2026           Moutier"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "official_l3 = official_raw[official_raw[\"Level\"] == 3]\n",
    "\n",
    "missing = official_l3[~official_l3[\"HistoricalCode\"].isin(lindas_raw[\"identifier.value\"])]\n",
    "\n",
    "# Ensure missing values are handled correctly\n",
    "missing = missing.replace({pd.NA: None, float('nan'): None})\n",
    "\n",
    "missing = missing[[\"HistoricalCode\", \"BfsCode\", \"ValidFrom\", \"Name\"]]\n",
    "print(missing.dtypes)\n",
    "missing.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7d59c0e3",
   "metadata": {},
   "source": [
    "## Aditional Wikidata Statistics"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "bafad9f7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "count.datatype    object\n",
      "count.type        object\n",
      "count.value       object\n",
      "dtype: object\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count.datatype</th>\n",
       "      <th>count.type</th>\n",
       "      <th>count.value</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.w3.org/2001/XMLSchema#integer</td>\n",
       "      <td>literal</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                             count.datatype count.type count.value\n",
       "0  http://www.w3.org/2001/XMLSchema#integer    literal           7"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "SELECT (COUNT(?s) as ?count) WHERE {\n",
    "  ?s ps:P13740 ?o.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "wiki_lindas = query_wikidata(query)\n",
    "\n",
    "print(wiki_lindas.dtypes)\n",
    "wiki_lindas.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "0ad1a4fb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "count.datatype    object\n",
      "count.type        object\n",
      "count.value       object\n",
      "dtype: object\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count.datatype</th>\n",
       "      <th>count.type</th>\n",
       "      <th>count.value</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.w3.org/2001/XMLSchema#integer</td>\n",
       "      <td>literal</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                             count.datatype count.type count.value\n",
       "0  http://www.w3.org/2001/XMLSchema#integer    literal          14"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "SELECT (COUNT(?s) as ?count) WHERE {\n",
    "  ?s ?p ?o.\n",
    "  ?o prov:wasDerivedFrom/pr:P13740 ?lindas.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "wiki_lindas_reference = query_wikidata(query)\n",
    "\n",
    "print(wiki_lindas_reference.dtypes)\n",
    "wiki_lindas_reference.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b1c16881",
   "metadata": {},
   "source": [
    "## Write Files"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "d936e9e7",
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "from datetime import date\n",
    "\n",
    "# String for today's date\n",
    "today_str = date.today().isoformat()  # e.g., '2025-08-04'\n",
    "\n",
    "# merge CSV\n",
    "merge.to_csv(f\"current_munies/{today_str}.csv\", index=False)\n",
    "\n",
    "# Summary JSON\n",
    "output = {\"current_munies\": summary,\n",
    "          \"number_of_lindas_ids_in_wikidata\": int(wiki_lindas[\"count.value\"][0]),\n",
    "          \"number_of_references_to_lindas_ids_in_wikidata\": int(wiki_lindas_reference[\"count.value\"][0]),\n",
    "          \"missing_lindas_versions\": missing.to_dict(orient=\"records\")}\n",
    "\n",
    "with open(f\"summaries/{today_str}.json\", \"w\", encoding=\"utf-8\") as f:\n",
    "    json.dump(output, f, indent=4)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
